//求符合给定条件的整数集
//给定不超过6的正整数a，考虑从a开始的连续4个数字，输出所有由他们组成的无重复数字的三位数
//输入格式：输入在一行中给出a
//输出格式：输出满足条件的三位数，要求从小到大，每行6个整数，整数间空格分离，但行末不能有多余空格
//输入样例：2
//输出样例：234 235 243 245 253 254
//          324 325 342 345 352 354
//			423 425 432 435 452 453
//			523 524 532 534 542 543 
#include<stdio.h>
int main()
{
	int a,i,j,k;
	int count=0;
	scanf("%d",&a);
	for(i=a;i<=a+3;i++){
		for(j=a;j<=a+3;j++){
			for(k=a;k<=a+3;k++)
			if(i!=j){
				if(i!=k){
					if(j!=k){
						count++;
						printf("%d%d%d",i,j,k);
						if(count%6==0){
							printf("\n");
						}else{
							printf(" ");
						}
					}
				}
			}
		}
	}
	
	return 0;
}
